{
    "global": {
      "logout_button": "Logout of the current user session.",
      "programControlButton": "Start or stop the program.",
      "releaseNotesButton": "View recent changes and updates.",
      "updateAvailableButton": "New version available.",
      "taskMonitorToggle": "Toggle the Task Monitor overlay.",
      "rateLimitsSectionToggle": "Toggle the Rate Limits overlay.",
      "notifications_button": "Toggle the Notifications overlay."
    },
    "home": {
      "toggle_container": "Control panel for adjusting time format, view mode, and displaying active downloads.",
      "collection_stats": "Overview of your media collection, including total movies, TV shows, episodes, and system uptime.",
      "recently_aired": "Shows episodes that have aired recently.",
      "airing_soon": "Upcoming episodes scheduled to air in the near future.",
      "upcoming_releases": "New movies or shows expected to be released soon.",
      "recently_added_movies": "Latest movies added to your collection.",
      "recently_added_shows": "Latest TV shows added to your collection.",
      "recently_upgraded": "Media items that have been upgraded to better quality versions."
    },
    "queues": {
      "queue-box-wanted": "Items identified from your lists that need to be downloaded but haven't been processed by the scraper yet. Shows the time the item was last scraped. If within 24 hours of scraping items will remain in the Wanted queue.",
      "queue-box-scraping": "Items actively being searched for download sources (torrents/magnets).",
      "queue-box-adding": "Items for which a source has been found and are being added to your debrid service.",
      "queue-box-checking": "Monitoring items for presence locally or in Plex. 'Cached': Available in debrid cache and ready to use. 'Downloading': Currently being downloaded with progress shown; grouped if multiple files. 'Filenames': Can be toggled to show specific files being processed.",
      "queue-box-unreleased": "Items identified but waiting for their release date before processing continues. Displays the relevant release date(s). Items requiring a physical release will indicate this.",
      "queue-box-blacklisted": "Items that have been explicitly marked to be ignored by the application.",
      "queue-box-upgrading": "Items that are being considered for Upgrading. They have been collected and now for 24 hours cli_debrid will try to find upgrades once an hour.",
      "queue-box-final_check": "Items for which initial scraping attempts failed. These items wait for a configured delay (defined in settings) before one last search attempt is automatically triggered. Shows when the item entered this waiting period. If the final search is successful, the item moves to Adding. If it fails again, the item is typically moved to Blacklisted.",
      "queue-box-pending_uncached": "Items associated with uncached torrents that would take your account over its limit wait in the Pending Uncached queue until your download limit returns to normal.",
      "queue-box-sleeping": "Items that cli_debrid failed to find. Shows a 'Wake Count' indicating how many times the item has been retried."
    },
    "settings": {
    },
    "logs": {
      "hidden-div": "What could this be...?"
    }
}
