{
  "helpData": {
    "Adding": "Cycle through all content returned from Scraping and try to add to Debrid. Cache status is followed based on settings. Full = add best result, Hybrid = add best cached result and fallback to uncached, None = add only cached. On failure of all results, move to Blacklisted. <br><br> <b>ACTION</b>: Process any items in Adding Queue.",
    "Blacklisted": "Check if any items qualify for unblacklisting if enabled, otherwise no action. <br><br> <b>ACTION</b>: Process any items in Blacklisted Queue.",
    "Final Scrape": "If Blacklist Final Scrape Delay Hours is set, wake items in this queue for one final scrape before Blacklisting. <br><br> <b>ACTION</b>: Process any items in Final Scrape Queue.",
    "Checking": "Check if item is present in Plex (if using Plex library), or on disk (if using Symlinked library). If Plex, move to Collected, if Symlinked, symlink the item and perform post-processing. <br><br> <b>ACTION</b>: Process any items in Checking Queue.",
    "Pending Uncached": "If over max active downloading file count in Debrid, wait in Pending Uncached queue until space becomes available. <br><br> <b>ACTION</b>: Process any items in Pending Uncached Queue.",
    "Scraping": "Perform series of scrapes using all scrapers for item. If multiple items present in Wanted or Scraping state seek Season or Series packs. Results passed to Adding queue. <br><br> <b>ACTION</b>: Process any items in Scraping Queue.",
    "Sleeping": "If item not found during Scraping, and item is less than 7 days old, sleep for 30 minutes and retry. Default 24 attempts over 12 hours (30 minutes each). If not found, move to Blacklisted. <br><br> <b>ACTION</b>: Process any items in Sleeping Queue.",
    "Unreleased": "Staging queue for items that are not yet released. <br><br> <b>ACTION</b>: Process any items in Unreleased Queue.",
    "Upgrading": "Items with a release date within 7 days are marked for upgrading. Hourly re-scrapes over 24 hours to find a better version if enabled. <br><br> <b>ACTION</b>: Process any items in Upgrading Queue.",
    "Wanted": "Items that will be released within the next 24 hours. Additionally staging queue for Scraping queue if too many items in Scraping queue. <br><br> <b>ACTION</b>: Process any items in Wanted Queue.",
    "Analyze Media Files": "Analyze 200 media files per run to verify playability. <br><br> <b>ACTION</b>: Process 200 media files in rclone mount using ffprobe. If found to be unplayable check if item is the last of its version, and if so move back to Wanted, otherwise move to Blacklisted.",
    "Check Database Health": "Check if media_items.db is healthy. <br><br> <b>ACTION</b>: Check if media_items.db is healthy.",
    "Check Plex Files Plex library only": "If Plex File Discovery is enabled, check if files have appeared in the rclone mount, and if so call an update in Plex for those files. [Plex Library Only] <br><br> <b>ACTION</b>: Check if files have appeared in the rclone mount, and if so call an update in Plex for those files.",
    "Check Service Connectivity": "Check if Plex/Jellyfin, Trakt, and Real Debrid are reachable. If not pause the queue until they are reachable again. <br><br> <b>ACTION</b>: Perform connectivity check for Plex/Jellyfin, Trakt, and Real Debrid.",
    "Check Trakt Early Releases": "Check if any items have been flagged for early release in Trakt based on popular lists. <br><br> <b>ACTION</b>: Check if any items have been flagged for early release and if so flag them in the database. This flag is used to bypass the Wanted/Unreleased queues.",
    "Get Plex Watch History": "Get watch history from Plex. Used to prevent addition of items that have been watched. <br><br> <b>ACTION</b>: Get watch history from Plex.",
    "Heartbeat": "Check if the service is running. You probably don't need to click this. <br><br> <b>ACTION</b>: Check if the service is running.",
    "Manual Plex Full Scan": "Performs a full scan of the Plex library and marks all items as Collected in the database. Used for those with a hybrid symlink/Plex library. <br><br> <b>ACTION</b>: Perform a full scan of the Plex library and mark all items as Collected in the database.",
    "Plex Full Scan Plex library only": "Performs a full scan of the Plex library and marks all items as Collected in the database. Part of regular Plex library operations. [Plex Library Only] <br><br> <b>ACTION</b>: Perform a full scan of the Plex library and mark all items as Collected in the database.",
    "Precompute Airing Shows": "Checks airing times for upcoming shows and ensures that move from Wanted to Scraping happens on time. <br><br> <b>ACTION</b>: Check airing times for upcoming shows.",
    "Process Bulk Subtitles": "Processes 200 media items at a time. Tries to find subtitles for items that don't currently have an associated SRT file and have not yet been processed. <br><br> <b>ACTION</b>: Process 200 media items at a time.",
    "Process Standalone Plex Removals": "If enabled, removes items that have been queued for removal from Plex. <br><br> <b>ACTION</b>: Process any items in Standalone Plex Removals Queue.",
    "Reconcile Queues": "Clear items from the Wanted queue that are already present in a Collected state for the associated version. <br><br> <b>ACTION</b>: Reconcile queue items.",
    "Refresh Download Stats": "Updates download stats for the home page from Debrid service. <br><br> <b>ACTION</b>: Refresh download stats.",
    "Refresh Plex Tokens": "Refreshes Plex tokens for the service. <br><br> <b>ACTION</b>: Refresh Plex tokens.",
    "Refresh Release Dates": "Updates release dates for all items in an Unreleased state. Ensures that if changes have occurred, the release date is updated. <br><br> <b>ACTION</b>: Refresh release dates.",
    "Regulate System Load": "Regulates queue speed based on CPU and RAM load. <br><br> <b>ACTION</b>: Regulate system load.",
    "Run Library Maintenance": "Run library maintenance tasks. For Plex libraries, checks that all items listed in the Plex library are also present on disk, and if not moves back to a Wanted state. For Symlinked libraries, checks that symlinks are not broken, and processes any orphan symlinks in the symlink folder. <br><br> <b>ACTION</b>: Run library maintenance tasks.",
    "Send Notifications": "Send any enabled notifications that have been queued. <br><br> <b>ACTION</b>: Send any enabled notifications.",
    "Sync Time": "Sync time with NTP server. <br><br> <b>ACTION</b>: Sync time with NTP server.",
    "Update Movie IDs": "Update movie IDs for all items in the database. Not generally recommended or needed. <br><br> <b>ACTION</b>: Update movie IDs for all items in the database.",
    "Update Movie Titles": "Update movie titles for all items in the database. Not generally recommended or needed. <br><br> <b>ACTION</b>: Update movie titles for all items in the database.",
    "Update Queue Views": "Syncs queue views from backend to frontend. <br><br> <b>ACTION</b>: Sync queue views from backend to frontend.",
    "Update Show IDs": "Update show IDs for all items in the database. Not generally recommended or needed. <br><br> <b>ACTION</b>: Update show IDs for all items in the database.",
    "Update Show Titles": "Update show titles for all items in the database. Not generally recommended or needed. <br><br> <b>ACTION</b>: Update show titles for all items in the database.",
    "Update TV Show Status": "Update TV show status for all items in the database. Not generally recommended or needed. <br><br> <b>ACTION</b>: Update TV show status for all items in the database.",
    "Verify Plex Removals": "If enabled, verifies that items have been removed from Plex. <br><br> <b>ACTION</b>: Verify that items have been removed from Plex.",
    "Verify Symlinked Files Symlink library only": "Verifies that symlinks have been successfully added to Plex library. Makes 10 attempts before assuming success. <br><br> <b>ACTION</b>: Process verification queue.",
    "default": "Processes any items from this Content Source. Content source items metadata are cached for 6 hours on addition and can be cleared on the Debug page. Items are added to the Wanted queue for processing. <br><br> <b>ACTION</b>: Process any items from this Content Source."
  }
} 